<a href="https://colab.research.google.com/github/hazra-kerubo/MTN-DataScienceET-Group/blob/main/MTN_Data_Analysis_Group_Work.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

** 1.0 BUSINESS UNDERSTANDING**
# Business understanding is the first stage of the Data Science Life Cycle that involves understanding what you want to accomplish from a business perspective and converting the business objective into a data mining task.
# The importance of this stage is to uncover important factors that could influence the outcome of your project. 

  1.1 Business Objective
  Our primary objective for the MTN Project is to upgrade its technology infrastructure for its mobile users in Ivory Coast. This will be achieved by applying pandas for cleaning the data and analysing the different telecommunication services in the country then giving a recommendation based on the results from the analysis.

  1.2 Assessing the Situation
  Here we look at what kind of data we will use for our analysis.
  We have various datasets among them containing the products of the telecommunication services that are used depending on the geographical area, the status of the service, the value of the products, the date and time the products are utilized.

  1.3 Determine the Data Mining Goals
  In this step we determine our business success criteria. The intended output of our project is being able to recommend ways that will help MTN upgrade the technology infrastructure for mobile users.
  We also look at the data mining success criteria which involves determining the most used telecommunication product in the cities  and getting the city that utilized the most services, hence bringing in the most revenue.

  1.4 Provide a Project Plan
This includes outlining the steps that shall be taken to achieve the business and the data mining goals. They include: 
1. Determining our business objective
2. Understanding the data 
3. Preparing and cleaning the data
4. Evaluating and analysing the data
5. Planning the final report and reveiwing the project

The main aim of our project is to meet the following objectives:
. Finding out which products were most used for three days.
. Finding out which cities brought in the most revenue to MTN.
. Determining which city used most products for the 3 days.

2.0 **DATA UNDERSTANDING**

2.1 Collect Data

The Data that we will use is secondary data that MTN gathered from the cities in Cote d'Ivoire. The data was collected over a 3-day period.

2.2 Describe the Data 2.2.1

The cells geo dataset contains the description,city, status of the service, location of the service, Cell ID and the Site ID.

2.2.2

The CDR Datasets 1,2 and 3 contain the product type, billing price, time of transaction, anonymised phone numbers of the person and the counterparty, country of the user and the counterparty and Cell and Site ID.

22.3 Explore the Data
1. Each Telcom dataset has 5001 rows and 10 columns
2. The Geo Data has about 3974 rows and 11 columns
3. The Geo data set didn't have any missing values, while the Telcom datasets had missing values which we removed.
4. We also renamed the columns to a standardized size and removed the  columns; CELL_ON_SITE, DW_A_NUMBER_INT, DW_B_NUMBER_INT, COUNTRY_A and COUNTRY_B.

2.4 Data Quality
After exploring and cleaning our data we found out that the data could be useful in helping us achieve our business objectives.

In [ ]:
# Importing libraries

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# Setting the Seaborn as the default Plotting library
sns.set()

In [ ]:
# Importing & Reading the Data Set 1
dataset1 = pd.read_csv ("/content/Telcom_dataset.csv")
dataset1.head()

  PRODUTC  VALUE DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  05:42.0  ...     19e2e      #NAME?      #NAME?
4   Voice     14  06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
# Importing & Reading the Dataset 2
dataset2 = pd.read_csv ("/content/Telcom_dataset2.csv")
dataset2.head()

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
# Importing & Reading the Dataset 3
dataset3 = pd.read_csv ("/content/Telcom_dataset3.csv")
dataset3.head()

  PRODUCT  VALUE DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61   01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0   01:31.0  ...     19e2e      #NAME?      #NAME?
2   Voice     10   02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0   03:04.0  ...     19e2e      #NAME?      #NAME?
4   Voice     22   03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
## Define columns on all datasets

dataset1.columns = dataset1.loc[0]
dataset2.columns = dataset2.loc[0]
dataset3.columns = dataset3.loc[0]

# Drop redudant rows
dataset1.drop(0, inplace=True)
dataset2.drop(0, inplace=True)
dataset3.drop(0, inplace=True)

# Resetting indices

dataset1.reset_index(drop=True, inplace=True)
dataset2.reset_index(drop=True, inplace=True)
dataset3.reset_index(drop=True, inplace=True)

In [ ]:
## We shall now investigate characteristics of the data namely;

# The size of the data
# Its data types
# A description of the data

In [ ]:
# Size of the datasets

print(dataset1.shape)
print(dataset2.shape)
print(dataset3.shape)

(5000, 10)
(5000, 10)
(5000, 10)

Our data contains 5001 rows and 10 columns.

In [ ]:
# Data types on dataset1

dataset1.dtypes

0
Voice              object
0                   int64
04:37.0            object
1                  object
49fae048b547780    object
1a49f8b0ded9de6    object
19e2e              object
19e2e              object
/TJNe+Mmtu         object
/TJNe+Mmtu         object
dtype: object

In [ ]:
# Data types on dataset2

dataset2.dtypes

0
sms                      object
0                         int64
2012-05-07 23:02:06.0    object
2                        object
32255675c3b6fe3          object
1aa7ae01386e9fb          object
19e2e                    object
19e2e                    object
+854AcBQT2               object
+854AcBQT2               object
dtype: object

In [ ]:
# Data types on dataset3

dataset3.dtypes

0
Voice              object
61                  int64
01:28.0            object
2                  object
966f68353622feb    object
ffd53a3bb2db6f1    object
19e2e              object
19e2e              object
+38u2u/rfx         object
+38u2u/rfx         object
dtype: object

In [ ]:
#  Investigate missing values

dataset1.isnull().sum()

0
Voice                0
0                    0
04:37.0              0
1                    0
49fae048b547780      0
1a49f8b0ded9de6      0
19e2e                0
19e2e                0
/TJNe+Mmtu           0
/TJNe+Mmtu         716
dtype: int64

In [ ]:
dataset2.isnull().sum()

0
sms                        0
0                          0
2012-05-07 23:02:06.0      0
2                          0
32255675c3b6fe3            0
1aa7ae01386e9fb            0
19e2e                      0
19e2e                      0
+854AcBQT2                 0
+854AcBQT2               676
dtype: int64

In [ ]:
dataset3.isnull().sum()

0
Voice                0
61                   0
01:28.0              0
2                    0
966f68353622feb      0
ffd53a3bb2db6f1      0
19e2e                0
19e2e                0
+38u2u/rfx           0
+38u2u/rfx         605
dtype: int64

Our datasets have missing values in the 'SITE_ID' variable. The number of missing values constitutes around 14% of the data.

In [ ]:
# Describe the dataset1

dataset1.describe(include='all')

0       Voice           0  04:37.0     1  ...  19e2e  19e2e  /TJNe+Mmtu  /TJNe+Mmtu
count    5000  5000.00000     5000  5000  ...   5000   5000        5000        4284
unique      3         NaN      707     7  ...      1      2        1780        1066
top     Voice         NaN  00:10.0     1  ...  19e2e  19e2e  ffa6759bb2  b47a998a3e
freq     2218         NaN       71  1251  ...   5000   4025         716          64
mean      NaN    25.87480      NaN   NaN  ...    NaN    NaN         NaN         NaN
std       NaN   101.94404      NaN   NaN  ...    NaN    NaN         NaN         NaN
min       NaN     0.00000      NaN   NaN  ...    NaN    NaN         NaN         NaN
25%       NaN     0.00000      NaN   NaN  ...    NaN    NaN         NaN         NaN
50%       NaN     0.00000      NaN   NaN  ...    NaN    NaN         NaN         NaN
75%       NaN    25.00000      NaN   NaN  ...    NaN    NaN         NaN         NaN
max       NaN  4440.00000      NaN   NaN  ...    NaN    NaN         NaN         NaN

[11 rows x 10 columns]

In [ ]:
# Describe the dataset2

dataset2.describe(include='all')

0        sms            0  2012-05-07 23:02:06.0  ...  19e2e  +854AcBQT2  +854AcBQT2
count   5000  5000.000000                   5000  ...   5000        5000        4324
unique     3          NaN                    787  ...      2        1661        1027
top      sms          NaN  2012-05-08 00:00:10.0  ...  19e2e  ffa6759bb2  91e86be9a6
freq    2328          NaN                     82  ...   4046         676          57
mean     NaN    24.339800                    NaN  ...    NaN         NaN         NaN
std      NaN    97.480726                    NaN  ...    NaN         NaN         NaN
min      NaN     0.000000                    NaN  ...    NaN         NaN         NaN
25%      NaN     0.000000                    NaN  ...    NaN         NaN         NaN
50%      NaN     0.000000                    NaN  ...    NaN         NaN         NaN
75%      NaN    25.000000                    NaN  ...    NaN         NaN         NaN
max      NaN  3380.000000                    NaN  ...    NaN         NaN         NaN

[11 rows x 10 columns]

In [ ]:
# Describe the dataset3

dataset3.describe(include='all')

0      Voice            61  01:28.0     2  ...  19e2e  19e2e  +38u2u/rfx  +38u2u/rfx
count   5000   5000.000000     5000  5000  ...   5000   5000        5000        4395
unique     3           NaN      645     9  ...      1      2        1586         951
top      sms           NaN  00:10.0     1  ...  19e2e  19e2e  ffa6759bb2  1ddea341cd
freq    2767           NaN       87  1239  ...   5000   4228         604          48
mean     NaN     26.434600      NaN   NaN  ...    NaN    NaN         NaN         NaN
std      NaN    224.222108      NaN   NaN  ...    NaN    NaN         NaN         NaN
min      NaN      0.000000      NaN   NaN  ...    NaN    NaN         NaN         NaN
25%      NaN      0.000000      NaN   NaN  ...    NaN    NaN         NaN         NaN
50%      NaN      0.000000      NaN   NaN  ...    NaN    NaN         NaN         NaN
75%      NaN     25.000000      NaN   NaN  ...    NaN    NaN         NaN         NaN
max      NaN  12900.000000      NaN   NaN  ...    NaN    NaN         NaN         NaN

[11 rows x 10 columns]

In [ ]:
# Standadize column names

dataset1.columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_A_number_INT', 'dw_B_Number_INT', 'country_A', 'country_B', 'cell_id', 'site_id']
dataset2.columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_A_number_INT', 'dw_B_Number_INT', 'country_A', 'country_B', 'cell_id', 'site_id']
dataset3.columns = ['product', 'value', 'date_time', 'cell_on_site', 'dw_A_number_INT', 'dw_B_Number_INT', 'country_A', 'country_B', 'cell_id', 'site_id']

 Most used product on Day 1, Day 2 and Day 3

In [ ]:
# For Day 1
dataset1['product'].value_counts()

Voice    2218
sms      1975
data      807
Name: product, dtype: int64

In [ ]:
# For Day 2
dataset2['product'].value_counts()

sms      2328
Voice    1906
data      766
Name: product, dtype: int64

In [ ]:
# For Day 3
dataset3['product'].value_counts()

sms      2767
Voice    1540
data      693
Name: product, dtype: int64

From the 3 days we see that sms was the most used as it was used in day 2 and 3.
The most used product on day 1 was voice.

In [ ]:
## Concating Datasets 1,2 & 3
df = pd.concat([dataset1,dataset2,dataset3], axis = 0)
df.head()

  product  value date_time  ... country_B     cell_id     site_id
0     sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
1     sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
2   Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
3   Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
4    data      0   07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN

[5 rows x 10 columns]

In [ ]:
df.shape

(15000, 10)

Cleaning the concated data, df, where we drop unnecessary columns, checking for duplicates and unique values.

In [ ]:
df.drop(['cell_on_site','dw_A_number_INT','dw_B_Number_INT','country_A','country_B'], axis = 1)

     product  value date_time     cell_id     site_id
0        sms      0   05:25.0  /+cKZKIp41  /+cKZKIp41
1        sms     25   05:41.0  /u0FSD+ahi  /u0FSD+ahi
2      Voice     56   05:42.0      #NAME?      #NAME?
3      Voice     14   06:29.0  051KhYDCpv  051KhYDCpv
4       data      0   07:26.0  /lrUXVGVcN  /lrUXVGVcN
...      ...    ...       ...         ...         ...
4995   Voice      0   01:43.0  2aa04dcab7  f7d63a29e5
4996   Voice     62   01:43.0  7f1f2f889f  b4ddb9e93c
4997   Voice     32   01:43.0  a4731e780e  d68260ef50
4998   Voice     30   01:43.0  98ed726da2  b4130b54ab
4999   Voice     60   01:43.0  1c11a2fcbb  6d70dae094

[15000 rows x 5 columns]

In [ ]:
df.duplicated().sum()

270

In [ ]:
df.drop_duplicates(inplace=True)

In [ ]:
df.duplicated().sum()

0

In [ ]:
# Looking at the descriptive stats of the concated df data
df.info

<bound method DataFrame.info of      product  value date_time  ... country_B     cell_id     site_id
0        sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
1        sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
2      Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
3      Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
4       data      0   07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN
...      ...    ...       ...  ...       ...         ...         ...
4994   Voice     10   01:43.0  ...     OTHER  6467daa1db  8a96bae9c1
4995   Voice      0   01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4996   Voice     62   01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     30   01:43.0  ...     19e2e  98ed726da2  b4130b54ab
4999   Voice     60   01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[14730 rows x 10 columns]>

In [ ]:
df.size

147300

In [ ]:
df.describe(include='all')

       product         value date_time  ... country_B     cell_id     site_id
count    14730  14730.000000     14730  ...     14730       14730       12785
unique       3           NaN      1934  ...         2        2680        1360
top        sms           NaN   00:10.0  ...     19e2e  ffa6759bb2  7f76d66503
freq      6948           NaN       137  ...     12088        1944         110
mean       NaN     25.547658       NaN  ...       NaN         NaN         NaN
std        NaN    153.674921       NaN  ...       NaN         NaN         NaN
min        NaN      0.000000       NaN  ...       NaN         NaN         NaN
25%        NaN      0.000000       NaN  ...       NaN         NaN         NaN
50%        NaN      0.000000       NaN  ...       NaN         NaN         NaN
75%        NaN     25.000000       NaN  ...       NaN         NaN         NaN
max        NaN  12900.000000       NaN  ...       NaN         NaN         NaN

[11 rows x 10 columns]

In [ ]:
df.head()

  product  value date_time  ... country_B     cell_id     site_id
0     sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
1     sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
2   Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
3   Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
4    data      0   07:26.0  ...     OTHER  /lrUXVGVcN  /lrUXVGVcN

[5 rows x 10 columns]

In [ ]:
df['date_time'].head()

0    05:25.0
1    05:41.0
2    05:42.0
3    06:29.0
4    07:26.0
Name: date_time, dtype: object

The 'date_time' column contains info about when a product was used. To understand it better, we need to split it into two

In [ ]:
time = []
dates = []

for date in df['date_time']:
    time.append(date.split(' ',)[1])
    
    dates.append(date.split(' ',)[0])

In [ ]:
# Importing the geographic information dataset

df_geos = pd.read_csv('cells_geo.csv')

# Splitting the geo dataset
df_geos = df_geos[";VILLES;STATUS;LOCALISATION;DECOUPZONE;ZONENAME;LONGITUDE;LATITUDE;REGION;AREA;CELL_ID;SITE_CODE"].str.split(pat = ';', n=11, expand = True)
df_geos.head()

  0        1           2          3   ...         8  9           10          11
0  0   ADJAME  In Service    ABIDJAN  ...     LAGUNE     fbb2e75af3  0bb492ef17
1  1   ADJAME  In Service    ABIDJAN  ...     LAGUNE     1502501d78  0bb492ef17
2  2   ADJAME  In Service    ABIDJAN  ...     LAGUNE     0c2e182a0c  0bb492ef17
3  3  ASSINIE  In Service  INTERIEUR  ...  SUD COMOE     69bdfc69fd  8a1e6ce31f
4  4  ASSINIE  In Service  INTERIEUR  ...  SUD COMOE     7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
# Assigning column names
df_geos.columns = ['VILLE','STATUS','LOCALISATION','DECOUPZONE','ZONENAME','LONGITUDE','LATITUDE','REGION','AREA','CELL_ID','SITE_CODE']
df_geos.head()

     VILLE      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0   ADJAME  In Service      ABIDJAN  ...       fbb2e75af3  0bb492ef17
1   ADJAME  In Service      ABIDJAN  ...       1502501d78  0bb492ef17
2   ADJAME  In Service      ABIDJAN  ...       0c2e182a0c  0bb492ef17
3  ASSINIE  In Service    INTERIEUR  ...       69bdfc69fd  8a1e6ce31f
4  ASSINIE  In Service    INTERIEUR  ...       7a1029d2ab  8a1e6ce31f

[5 rows x 11 columns]

Cleaning Geo Data by checking for null values, duplicates.

In [ ]:
df_geos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLE         3974 non-null   object
 1   STATUS        3974 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3974 non-null   object
 5   LONGITUDE     3974 non-null   object
 6   LATITUDE      3974 non-null   object
 7   REGION        3974 non-null   object
 8   AREA          3974 non-null   object
 9   CELL_ID       3974 non-null   object
 10  SITE_CODE     3974 non-null   object
dtypes: object(11)
memory usage: 341.6+ KB

In [ ]:
df_geos.isnull()

      VILLE  STATUS  LOCALISATION  ...   AREA  CELL_ID  SITE_CODE
0     False   False         False  ...  False    False      False
1     False   False         False  ...  False    False      False
2     False   False         False  ...  False    False      False
3     False   False         False  ...  False    False      False
4     False   False         False  ...  False    False      False
...     ...     ...           ...  ...    ...      ...        ...
3969  False   False         False  ...  False    False      False
3970  False   False         False  ...  False    False      False
3971  False   False         False  ...  False    False      False
3972  False   False         False  ...  False    False      False
3973  False   False         False  ...  False    False      False

[3974 rows x 11 columns]

In [ ]:
df_geos.isnull().sum()

VILLE           0
STATUS          0
LOCALISATION    0
DECOUPZONE      0
ZONENAME        0
LONGITUDE       0
LATITUDE        0
REGION          0
AREA            0
CELL_ID         0
SITE_CODE       0
dtype: int64

In [ ]:
df_geos.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
3969    False
3970    False
3971    False
3972    False
3973    False
Length: 3974, dtype: bool

In [ ]:
df_geos.duplicated().sum()

43

In [ ]:
df_geos.drop_duplicates(inplace = True)
df_geos.duplicated().sum()

0

In [ ]:
df_geos.shape

(3931, 11)

In [ ]:
df_geos.describe()

         VILLE      STATUS LOCALISATION  ...           AREA     CELL_ID   SITE_CODE
count     3931        3931         3931  ...           3931        3931        3931
unique     504           2            2  ...              7        3916        1029
top     COCODY  In Service    INTERIEUR  ...  ABIDJAN NORTH  6750e0fb7b  20387d4292
freq       353        3890         2286  ...           1203          13          16

[4 rows x 11 columns]

Checking the common column on the two datasets, df and df_geos.

In [ ]:
df_geos['SITE_CODE'].isin(df['site_id']).value_counts()

True     3411
False     520
Name: SITE_CODE, dtype: int64

In [ ]:
df_merged = pd.merge(df,df_geos, left_on = 'site_id', right_on = 'SITE_CODE')
df_merged.head()

  product  value date_time  ...          AREA     CELL_ID   SITE_CODE
0     sms      0   00:00.0  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0   00:00.0  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0   00:00.0  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d
3     sms      0   00:00.0  ...  CENTRE NORTH  c2545171dc  1b5540c02d
4     sms      0   00:00.0  ...  CENTRE NORTH  f15bd5483f  1b5540c02d

[5 rows x 21 columns]

In [ ]:
df_merged.shape

(49581, 21)

**DATA ANALYSIS**

In [ ]:
# Most used city for the three days?
df_merged['VILLE'].value_counts()

YOPOUGON            8432
ABOBO               6159
COCODY              3704
ADJAME              2505
KOUMASSI            2275
                    ...
YAKASSE-ATTOBROU       3
RUBINO                 3
ALLOKOI                3
KOTOULA                2
DANANON                2
Name: VILLE, Length: 398, dtype: int64

In [ ]:
df_merged['VILLE'].value_counts().idxmax()

'YOPOUGON'

In [ ]:
# Which one was the most used product for the three days?
df_merged['product'].value_counts()

sms      28604
Voice    20977
Name: product, dtype: int64

In [ ]:
df_merged['product'].value_counts().idxmax()

'sms'

In [ ]:
#Checking the revenue generated in the cities
df_merged.groupby('VILLE')['value'].sum().sort_values(ascending=True)

VILLE
SERHIO              0
BROFODOUME          0
SAPLI               0
TIEMA               0
YOUWASSO            0
                ...
TREICHVILLE     63969
KOUMASSI        71356
ABOBO          124210
COCODY         177745
YOPOUGON       202167
Name: value, Length: 398, dtype: int64

**RECOMMENDATIONS**


1.   To maximize on profitability MTN should improve infrastructure on voice 
2.   From the analysis, we noticed that none of the cities use data as an MTN product, hence MTN should put more awareness on data as a product.
3. MTN should expand their infrastructure in Yopougon since it brings in the most revenue.
4. MTN should also create awareness on the cities which do not utilize their products by giving offers on the products, having subsidised rates, etc.